Tekla Open API Reference for Tekla Structures 2025
PluginFormBase Events
The PluginFormBase type exposes the following members.
Events
Name | Description
AttributesLoadedFromModel
 The AttributesLoadedFromModel event is triggered just after the attributes have been loaded from the model into the dialog.
Top
See Also
Reference
PluginFormBase Class
Tekla.Structures.Dialog Namespace